KCX-Mapping-Convert/testdaten/EMCS-V20/UidsFromKids/EMCSCancellation.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Header xmlns="http://www.eurtradenet.com/schemas/header/200310" soap:mustUnderstand="true"><To>DE01.CSFALT.2144</To><From>DE.CSF</From><MessageID>EI20100519</MessageID><SentAt>2010-05-19 12:02:00 +0200</SentAt><Act>request</Act><Method>EMCS</Method><MessageVersion>2.0</MessageVersion><MessageType>EMCSCancellationEAAD</MessageType></Header></soap:Header><soap:Body><Submit xmlns="http://www.eurtradenet.com/schemas/uids/emcs/body/200911"><EMCS><EMCSCancellationEAAD><LocalReferenceNumber>ReferenceNumber</LocalReferenceNumber><AadReferenceCode>AadReferenceCode</AadReferenceCode><DateAndTimeOfValidation>2010-05-19T14:55:00+0200</DateAndTimeOfValidation><CancellationReasonCode>CRC</CancellationReasonCode><ComplementaryInformation language="DE">V20-ComplementaryInformation</ComplementaryInformation></EMCSCancellationEAAD></EMCS></Submit></soap:Body></soap:Envelope>
